<html>
<head>
<title>&Uuml;berblick</title>
<meta name="author" content="Veit Gr&ouml;sch">
<link rel=stylesheet type="text/css" href="../Css/Zeugnisstyles.css">
</head>
<body alt="" border="0" text="#000000" bgcolor="#FFFFFF" link="#FF0000" alink="#FF0000" vlink="#FF0000">
<table width="100%" >
<tr>
 <td bgcolor="#EFEFEF" valign="top" width="200">
 <p class="title">Texel-Hilfe</p>
<img src="../Bilder/Logoklein.gif" width="200"  border="0" alt="">
<p class="textgcenter">
<a class="other" href="../../Texelhilfe.html">Einleitung</a><br>
<a class="other" href="Beispiele.html">Beispiele</a><br>
<a class="other" href="Ueberblick.html">&Uuml;berblick</a><br>
<a class="other" href="Installation.html">Installation</a><br>
<a class="other" href="Organisation.html">Organisation</a><br>
<a class="other" href="Einstellungen.html">Einstellungen</a><br>
<a class="other" href="Schuelerdaten.html">Sch&uuml;lerdaten</a><br>
<a class="other" href="Layout.html">Layout</a><br>
<a class="other" href="Dateivorlagen.html">Dateivorlagen</a><br>
<a class="other" href="Schreiben.html">Schreiben</a><br>
<a class="other" href="Einlesen.html">Einlesen</a><br>
<a class="other" href="Korrigieren.html">Korrigieren</a><br>
Ausdrucken<br>
<a class="other" href="Lueckentexteditor.html">L&uuml;ckentexteditor</a><br>
<a class="other" href="Kontakt.html">Kontakt</a><br>
<br></p>

 </td>
 <td valign="top">
<p class="title">Eine Zeugnisverwaltung f&uuml;r Waldorfschulen</p>
<p align="center"><img src="../Bilder/ButtonDrucken.gif" width="102" height="27" border="0" alt=""></p>
<p class="textcenter">
Nach dem Korrigieren k&ouml;nnen die Zeugnisse endlich gedruckt werden.
</p>

<p align="center"><IMG SRC="../Bilder/Drucken.gif" WIDTH=509 HEIGHT=477 BORDER=0 ALT="" USEMAP="#Drucken_Map"></p>
<MAP NAME="Drucken_Map">
<AREA href="#Kopien" SHAPE="rect" ALT="" COORDS="331,393,428,459" title="Hier werden Zeugniskopien als Kladde zum Korrekturlesen oder f&uuml;r einen zus&auml;tzlichen Ausdruck gemacht.">
<AREA href="#Kopien" SHAPE="rect" ALT="" COORDS="261,389,328,461" title="Hier lassen sich Kopien aller Zeugnistexte in einfachen Textdateien zur Archivierung anlegen.">
<AREA href="#Ausdrucken" SHAPE="rect" ALT="" COORDS="19,390,244,458" title="Sollte das Zusatzblatt nicht ausreichen, k&ouml;nnen zus&auml;tzliche Bl&auml;tter mit weiteren Texten gedruckt werden, wenn im Layout eintr&auml;ge vorhanden sind.">
<AREA href="#LeereEinlegeblaetter" SHAPE="rect" ALT="" COORDS="253,336,479,370" title="Sollten die Fachlehrer lieber mit der Hand schreiben, k&ouml;nnen hier auch leere Einlegebl&auml;tter gedruckt werden, die im Layout an das Doppelblatt angepasst sind.">
<AREA href="#Ausdrucken" SHAPE="rect" ALT="" COORDS="255,241,478,330" title="Das A4-Einlegeblatt enth&auml;lt weitere Fachtexte.">
<AREA href="#Zeugnissprueche" SHAPE="rect" ALT="" COORDS="20,308,242,371" title="Hier kann f&uuml;r die Klassen 1 bis 7 ein Extrablatt gedruckt werden, das nur den Zeugnisspruck enth&auml;lt.">
<AREA href="#Zeugnissprueche" SHAPE="rect" ALT="" COORDS="19,226,241,296" title="F&uuml;r die Klassen 1 bis 7 kann hier eingestellt werden, ob der Zeugnisspruch mit auf das Innenblatt gedruckt werden soll.">
<AREA href="#Ausdrucken" SHAPE="rect" ALT="" COORDS="18,190,244,228" title="Hier wird die Innenseite des Doppelblattes mit Fachtexten oder dem Klassenlehrerzeugnis gedruckt.">
<AREA href="#Ausdrucken" SHAPE="rect" ALT="" COORDS="21,135,243,187" title="Hier wird die Au&szlig;enseite des A3-Doppelblattes mit der Zeugnisvorder- und R&uuml;ckseite gedruckt.">
<AREA href="#Ausdrucken" SHAPE="rect" ALT="" COORDS="254,126,482,206" title="Normalerweise werden Striche f&uuml;r Unterschriften gedruckt. Die Lehrernamen k&ouml;nnen aber auch unter die Texte gedruckt werdem.">
<AREA href="#Ausdrucken" SHAPE="rect" ALT="" COORDS="283,64,449,113" title="Pr&uuml;fen sie hier, ob Texte zu allen F&auml;chern, die im Layout eingetragen sind, eingelesen wurden.">
<AREA href="#Ausdrucken" SHAPE="rect" ALT="" COORDS="13,69,247,127" title="W&auml;hlen Sie hier einen oder alle Sch&uuml;ler aus, deren Zeugnisse gedruckt werden sollen.">
</MAP>


<p class="textcenter">
<a class="other" href="#Vorbereitungen">Vorbereitungen<br>
<a class="other" href="#Ausdrucken">Ausdrucken der Zeugnisse<br>
<a class="other" href="#Layout">Seitenentwurf anpassen<br>
<a class="other" href="#Zeugnissprueche">Zeugnisspr&uuml;che<br>
<a class="other" href="#LeereEinlegeblaetter">Leere Einlegebl&auml;tter<br>
<a class="other" href="#Kopien">Zeugniskopien<br>
</p>


<hr width="90%">
<a name="Vorbereitungen"></a>
<p class="titleklein">Vorbereitungen</p>
<p class="text">Um die A3-Doppelb&ouml;gen zu drucken ben&ouml;tigen Sie selbstverst&auml;ndlich einen <b>A3-Drucker</b>. Um die Zeugnisse farbig zu drucken reicht ein einfacher A3-Tintenstrahldrucker. Die A4-Einlege- und Zusatzbl&auml;tter k&ouml;nnen mit jedem schnelleren Tintenstrahldrucker ausgedruckt werden. Um mehrere Klassen in ausreichend kurzer Zeit, n&auml;mlich zwischen der Zeugniskonferenz und dem Austeilen der Zeugnisse zu drucken, empfehlen sich schnellere Drucker. In Elmshorn haben wir die Zeugnisse f&uuml;r 9 Klassen auf 2 Druckern gedruckt. Es empfieht sich aber 3 Drucker zur Verf&uuml;gung zu haben. Oft ist es auch m&ouml;glich, die Au&szlig;enb&ouml;gen, die ja keine Fachtexte besitzen schon vorher zu drucken, auch fertige Klassenlehrerzeignisse k&ouml;nnen oft schon vorher gedruckt werden.<br>
<br>
Die Zeugnisseiten sind organisiert als Access-Berichte. Die Daten und Texte werden in Tabellenabfragen bereitgestellt und in einem vorgegebenen Seitenentwurf ausgedruckt. Unten ist beschrieben, wie Sie den <a class="other" href="#Layout">Entwurf anpassen</a> k&ouml;nnen.<br>
<br>
Werden ganze <b>Klassens&auml;tze</b> einer Zeugnisseite gedruckt, werden die <b>Vorder- und die R&uuml;ckseite</b> in verschiedener Reihenfolge gedruckt. Die Zeugnisse brauchen also nicht umsortiert werden. Nach dem Druck einer Seite, braucht der Stapel nur so wie er ist wieder in den Papierschacht gelegt zu werden.<br>
<br>
Eine <b>Vorschau</b> der Zeugnisseiten erh&auml;lt man in Access nur, wenn ein Druckertreiber installiert ist. Um die A3-Doppelbl&auml;tter in der Vorschau zu sehen, installieren sie einfach den Treiber eines A3-Druckers, den Drucker selbst ben&ouml;t&ouml;igen Sie dazu nicht. Im Download-Paket ist der Treiber des Druckers HP Inkjet 2600 f&uuml;r Windows 2000 und Windows XP enthalten. Eine <a class="other" href="Installation.html#Druckertreiber">Anleitung zur Installation</a> finden Sie in dieser Hilfe.<br>
<br>
Nach dem Aufruf der <b>Vorschau einer A3-Zeugnisseite</b> &uuml;ber die Schaltfl&auml;che Vorschau auf dem Texel-Druckformular: <img src="../Bilder/Vorschau.gif" width="34" height="33" border="0" alt=""> m&uuml;ssen sie noch f&uuml;r diese Zeugnisseite den Drucker einrichten, bevor Sie die Vorschau richtig sehen. Rufen Sie im Menue Datei den Punkt Seite einrichten auf, dann das Blatt Seite, spezieller Drucker, die Schaltfl&auml;che Drucker, w&auml;hlen sie dann z.B. den HP 2600 aus, <i>Eigenschaften, Papiergr&ouml;&szlig;e A3</i> und unter <i>Grundlagen</i> die Option Querformat.<br>
<br>
Sp&auml;ter kann es sein, dass Sie nur einen Teil des Klassensatzes drucken wollen, z. B. wenn das der Seitenentwurf nur f&uuml;r einen Teil passen ist. Dazu rufen Sie den Menuepunkt Datei-Drucken auf und geben die zu druckenden Seiten dort ein.</p>
<p class="textcenter"><a class="other" href="Ausdrucken.html">Inhalt</a></p>
<hr width="90%">

<a name="Ausdrucken"></a>
<p class="titleklein">Ausdrucken der Zeugnisse</p>
<p class="text">Nach dem Aufruf des Druckfomulars w&auml;hlen sie zun&auml;chst alle Sch&uuml;ler oder den Sch&uuml;ler aus, dessen Zeugnisse Sie drucken wollen. &Uuml;ber die Schlaltfl&auml;che <i>Fehlen Texte?</i> erfahren sie ob Fachtexte, die im Layout eingetragen wurden, noch nicht eingelesen wurden, und ob alle Texte, die eingelesen wurden auch im Layout eingetragen sind. Die Nummern von Zusatzbl&auml;ttern erscheinen nur, wenn f&uuml;r den ausgew&auml;hlten Sch&uuml;ler auch Texte daf&uuml;r vorliegen. Stellen sie auch ein, ob Striche f&uuml;r die Lehrerunterschriften oder der Lehrername unter die Texte gedruckt werden soll. F&uuml;r die Zeugnisse, die den Sch&uuml;lern ausgeh&auml;ndigt werden, sind die Striche gedacht, f&uuml;r sp&auml;tere Kopien eignet sich das Ausdrucken der Lehrernamen.<br>
<br>
Es empfielt sich vor dem Ausdrucken erst eine Vorschau &uuml;ber die jeweiligen Schaltfl&auml;chen Vorschau: <img src="../Bilder/Vorschau.gif" width="34" height="33" border="0" alt=""> einzusehen. Sollten die Texte nicht auf die Seite passen, gibt es zwei M&ouml;glichkeiten. Entweder Sie verschieben F&auml;cher von dieser Seite auf andere Seiten, in dem sie im Layout die Zuordnungen &auml;ndern, oder Sie ver&auml;ndern den <a class="other" href="#Layout">Seitenentwurf</a>.<br>
<br>
Nach dem Drucken schlie&szlig;en Sie die Vorschau &uuml;ber das rote Kreuzchen oben rechts am Fenster. Die Druckereinstellungen k&ouml;nnen dabei gespeichert werden.</p>
<p class="textcenter"><a class="other" href="Ausdrucken.html">Inhalt</a></p>
<hr width="90%">

<a name="Layout"></a>
<p class="titleklein">Seitenentwurf anpassen</p>
<p class="text">Ist nur wenig Text auf der Seite zu viel, k&ouml;nnen Sie aber auch den Seitenentwurf dieses Access-Berichtes geringf&uuml;gig &auml;ndern: Dazu w&auml;hlen sie zun&auml;chst die Vorschau der Seite und rufen vor dem Ausdrucken in der Access-Menueleiste den Befehl <i>Ansicht-Entwurfsansicht</i> oder kurz die Schaltfl&auml;che <img src="../Bilder/Entwurfsansicht.gif" width="19" height="19" border="0" alt=""> auf. </p>
<p class="textcenter">Ein Zeugnisseite in der Entwurfsansicht:<br><br>
<img src="../Bilder/Entwurf.gif" width="780" height="376" border="0" alt=""></p>
<p class="text">Die Texte, die in der Tabelle gespeichert sind, werden in den dargestellten Textfeldern ausgegeben. Verbreitern sie nicht den karierten Hintergrund, sonst erhalten Sie Leerseiten zwischen den Zeugnisseiten.<br>
Im Kopfbereich wird die Schule und der Sch&uuml;lername augezeigt hier k&ouml;nnen sie Platz sparen, in dem Sie die einzelnen Textfelder verschieben, und den gesamten Kopfbereich  durch verschieben des grauen Balkens unterhalb des Bereichs verkleinern.<br>
Im Detailbereich ist der Entwurf f&uuml;r den Abschnitt mit einem Fachtext. Dieser Bereich wird f&uuml;r jeden Text der Seite wiederholt. Hier k&ouml;nnen Sie Platz sparen, indem Sie die Textfelder zusammenschieben und den grauen Balken unterhalb des Bereichs nach oben ziehen. Eine drastische Ma&szlig;nahme ist, das Textfeld f&uuml;r den Fachtext doppelt anzuklicken und im Eigenschaftenfenster unter Format die Schriftgr&ouml;&szlig;e zu verkleinern.<br>
<br>
Genauere Informationen zu Access-Berichten (Reports) finden Sie in der Access-Hilfe oder in der Fachliteratur</p>
<p class="textcenter">Ein fertiges Einlegeblatt:<br><br>
<img src="../Bilder/Einlegeblatt.gif" width="549" height="775" border="0" alt=""></p>
<hr width="90%">

<a name="Zeugnissprueche"></a>
<p class="titleklein">Zeugnisspr&uuml;che</p>
<p class="text">F&uuml;r die Klassen 1 bis 7 k&ouml;nnen Sie ausw&auml;hlen, ob der Zeugnisspruch unter den Klassenlehrertext auf die Innenseite des Doppelblattes gedruckt werden soll. Dann sind neben dem Klassenlehrerzeugnis aber keine weiteren Fachtexte mehr m&ouml;glich, auch wenn Sie im Layout eingetragen sind.<br>
Au&szlig;erdem k&ouml;nnen Extrabl&auml;tter gedruckt werden, die nur den Zeugnisspruch enthalten.</p>
<p class="textcenter">Ein Extrablatt mit dem Zeugnisspruch:<br><br>
<img src="../Bilder/ExtrablattZeugnisspruch.gif" width="415" height="586" border="0" alt=""></p>
<p class="textcenter"><a class="other" href="Ausdrucken.html">Inhalt</a></p>
<hr width="90%">

<a name="LeereEinlegeblaetter"></a>
<p class="titleklein">Leere Einlegebl&auml;tter</p>
<p class="text">Sollten die Fachlehrer im Gegensatz zum Klassenlehrer oder den Epochenlehrern noch mit der Hand schreiben wollen, k&ouml;nnen sie leere Einlegebl&auml;tter ausdrucken, um ein einheitliches Layout zu gew&auml;hrleisten. Die F&auml;cher legen Sie auch im Layout fest. Hier k&ouml;nnen die Kollegen dann per Hand eintragen.</p>
<p class="textcenter">Ein leeres Einlegeblatt:<br><br>
<img src="../Bilder/Einlegeblattleer.gif" width="473" height="667" border="0" alt=""></p>
<p class="textcenter"><a class="other" href="Ausdrucken.html">Inhalt</a></p>
<hr width="90%">

<a name="Kopien"></a>
<p class="titleklein">Zeugniskopien</p>
<p class="textcenter"><IMG SRC="../Bilder/Kopie.gif" WIDTH=183 HEIGHT=85 BORDER=0 ALT="" USEMAP="#Kopie_Map"></p>
<MAP NAME="Kopie_Map">
<AREA SHAPE="rect" ALT="" COORDS="122,19,168,73" title="Sofortiges Ausdrucken der Kladdekopien.">
<AREA SHAPE="rect" ALT="" COORDS="76,19,121,72" title="Vorschau f&uuml;r die Zeugniskopien als Kladdeausdruck.">
<AREA SHAPE="rect" ALT="" COORDS="27,22,75,69" title="Hier werden Zeugniskopien zur Archivierung gespeichert.">
</MAP>
<p class="text">Da die Zeugnisse viele Jahre lang archiviert werden m&uuml;ssen, besteht &uuml;ber die Schaltfl&auml;che <i>Kopien speichern</i> <img src="../Bilder/Kopiespeichern.gif" width="34" height="33" border="0" alt=""> die M&ouml;glichkeit die gesamten Zeugnistexte als einfache Textdateien mit der Endung .txt zu speichern, in der Hoffnung, dass diese Dateien auch in 40 Jahren noch lesbar sind. F&uuml;r jeden Sch&uuml;ler wird eine eigene Datei erstellt. Sind alle Sch&uuml;ler ausgew&auml;hlt, wird ein neuer Ordner f&uuml;r die Dateien erstellt.<br>
<br>
Zum Korrektur lesen oder f&uuml;r die Archivierung auf Papier lassen sich Kladdeausdrucke in schwarzer Schrift auf durchnummerierten A4-Bl&auml;ttern herstellen. Ein Beispiel finden Sie auf der Seite <a class="other" href="Korrigieren.html#Kladde">Korrigieren</a>.</p>
<p class="textcenter"><a class="other" href="Ausdrucken.html">Inhalt</a></p>
<hr width="90%">


</td></tr></table>
</body>
</html>