<html>
<head>
<title>&Uuml;berblick</title>
<meta name="author" content="Veit Gr&ouml;sch">
<link rel=stylesheet type="text/css" href="../Css/Zeugnisstyles.css">
</head>
<body alt="" border="0" text="#000000" bgcolor="#FFFFFF" link="#FF0000" alink="#FF0000" vlink="#FF0000">
<table width="100%" >
<tr>
 <td bgcolor="#EFEFEF" valign="top" width="200">
 <p class="title">Texel-Hilfe</p>
<img src="../Bilder/Logoklein.gif" width="200"  border="0" alt="">
<p class="textgcenter">
<a class="other" href="../../Texelhilfe.html">Einleitung</a><br>
<a class="other" href="Beispiele.html">Beispiele</a><br>
<a class="other" href="Ueberblick.html">&Uuml;berblick</a><br>
<a class="other" href="Installation.html">Installation</a><br>
<a class="other" href="Organisation.html">Organisation</a><br>
<a class="other" href="Einstellungen.html">Einstellungen</a><br>
<a class="other" href="Schuelerdaten.html">Sch&uuml;lerdaten</a><br>
<a class="other" href="Layout.html">Layout</a><br>
<a class="other" href="Dateivorlagen.html">Dateivorlagen</a><br>
<a class="other" href="Schreiben.html">Schreiben</a><br>
Einlesen<br>
<a class="other" href="Korrigieren.html">Korrigieren</a><br>
<a class="other" href="Ausdrucken.html">Ausdrucken</a><br>
<a class="other" href="Lueckentexteditor.html">L&uuml;ckentexteditor</a><br>
<a class="other" href="Kontakt.html">Kontakt</a><br>
<br></p>

 </td>
 <td valign="top">
<p class="title">Eine Zeugnisverwaltung f&uuml;r Waldorfschulen</p>
<p align="center"><img src="../Bilder/ButtonTexteeinlesen.gif" width="177" height="27" border="0" alt=""></p>
<p class="textcenter">
Jetzt werden alle Dateien in die Datenbank eingelesen.
</p>


<p align="center"><IMG SRC="../Bilder/Einlesen.gif" WIDTH=301 HEIGHT=231 BORDER=0 ALT="" USEMAP="#Einlesen_Map"></p>
<MAP NAME="Einlesen_Map">
<AREA SHAPE="rect" ALT="" COORDS="124,158,232,212" HREF="#Sammeln" title="Pr&uuml;ft, ob alle Fachtexte der F&auml;cher, die im Layout eingetragensind, schon eingelesen wurden.">
<AREA SHAPE="rect" ALT="" COORDS="13,158,121,208" HREF="#Einlesen" title="Liest die Texte aus den auszuw&auml;hlenden Dateien ein und speichert sie in der Datenbank ab.">
<AREA SHAPE="rect" ALT="" COORDS="5,120,281,156" HREF="#Einlesen" title="Eingelesene Dateien werden nach Klassen sortiert in Verzeichnisse eingeordnet.">
<AREA SHAPE="rect" ALT="" COORDS="6,76,278,115" HREF="#Einlesen" title="Es werden alle Dateien aus dem auszuw&auml;hlenden Verzeichnis eingelesen, die zur Klasse geh&ouml;ren.">
</MAP>


<p class="textcenter">
<a class="other" href="#Sammeln">Sammeln und Durchschauen der Dateien<br>
<a class="other" href="#Einlesen">Einlesen der Dateien<br>
<a class="other" href="#Probleme">Probleml&ouml;sungen<br>
<a class="other" href="#Verwaltung">Verwalten der Fachtexte<br>
</p>


<hr width="90%">
<a name="Sammeln"></a>
<p class="titleklein">Sammeln und Durchschauen der Dateien</p>
<p class="text">Kurz vor der Zeugniskonferenz, in der die Zeugnisse Korrektur gelesen werden, m&uuml;ssen alle Disketten mit den fertig schriebenen Fachtexten abgegeben sein.<br>
Die Dateien aller zu bearbeitenden Klassen werden in einem Verzeichnis auf der Festplatte des Rechners, auf dem die Zeugnisdatenbank installiert ist, gesammelt.<br>
Viele Probleme, die beim Einlesen auftauchen k&ouml;nnen, lassen sich vermeiden, wenn die Dateien vor dem Einlesen in die Datenbank kurz auf formelle Fehler durchgesehen werden. Dazu sind vor allem bei vielen Klassen mehrere Kollegen n&ouml;tig, da die Zeit jetzt dr&auml;ngt.<br>
Achten sollte man auf folgende Punkte:<br>
<br>
Steht am Anfang die Lehrerzeile im richtigen Format?<br>
Beginnen alle Sch&uuml;lerzeilen mit einer Sch&uuml;lernummer?<br>
Folgt in der Sch&uuml;lerzeile auf den Sch&uuml;lernamen kein weiterer Text?<br>
Sind in den Fachtexte unn&ouml;tige Zeilenumbr&uuml;che, die das Zeugnis unn&ouml;tig viel Pltaz einnehmen lassen?<br>
<br>
Dabei gen&uuml;gt es die Dateien grob anzuschauen. die meisten Probleme werden beim Einlesen von Texel erkannt und k&ouml;nnen dan noch korrigiert werden.</p>
<p class="textcenter"><a class="other" href="Einlesen.html">Inhalt</a></p>
<hr width="90%">

<a name="Einlesen"></a>
<p class="titleklein">Einlesen der Dateien</p>
<p class="text">Soll nur eine einzelne Datei eingelesen werden und nicht in einen Ordner eingeordnet werden, wird keine der beiden Optionen angew&auml;hlt. Sollen alle Dateien einer Klasse aus einem Verzeichnis eingelesen werden, w&auml;hlen Sie die Option <i>Alle Dateien aus dem Verzeichnis</i>.<br>
Beim Einlesen der Dateien sollte man die Dateien gleich in ein Verzeichnis einordnen lassen, das den Namen der Klasse tr&auml;gt. so sind die Dateien nach dem Einlesen sortiert und man kann sehen, welche Dateien noch eingelesen werden m&uuml;ssen, falls sp&auml;ter noch Dateien hinzukommen. W&auml;hlen Sie dazu die Option <i>Dateien in Verzeichnisse einordnen</i>.<br>
So k&ouml;nnen nacheinander die Dateien aller Klassen in die verschiedenen Datenbanken eingelesen werden, bis keine Datei mehr im Verzeichnis vorhanden sind. Alle Dateien sind dann schon sortiert und k&ouml;nnen archiviert werden. Sollte sp&auml;ter eine Datei noch einmal eingelesen werden m&uuml;ssen, w&auml;hlen Sie beide Optionen ab und lesen die einzelne Datei noch einmal ein.<br>
Gibt es beim Einlesen keine Probleme, erfahren Sie beim Einlesen, welche Fa&auml;cher eingelesen werden und wie viele Texte jeweils abgespeichert wurden. Haken sie die F&auml;cher in Ihrem Ausdruck des Layouts ab und notieren Sie jeweils die Anzahl der eingelesenen Texte. So bekommen Sie einen &Uuml;berblick, wo noch Texte fehlen.<br>
Auch die Schaltfl&auml;che <i>Fehlen Texte?</i> gibt Auskunft dar&uuml;ber, zu welchen F&auml;chern des Layouts nch keine Texte eingelesen wurden.<br>
Beim Einlesen werden auch L&uuml;cken in L&uuml;ckentexten ersetzt und die angew&auml;hlten Korrekturen gemacht. &Uuml;ber das Einlesen und die dabei gemachten Korrekturen wird ein Protokoll gef&uuml;hrt. Dieses kann eingesehen werden &uuml;ber die entsprechende Schaltfl&auml;che im Formular Klasse und Schuljahr.<br>
Ist in der Datei ein Vortext f&uuml;r alle Sch&uuml;ler vorhanden, wird dieser jetzt jedem einzelnen Sch&uuml;lertext vorangestellt. Korrekturen in dem Vortext m&uuml;ssen dann bei jedem Sch&uuml;ler gemacht werden. Allerdings ist eine klassenweite Ersetzen-Funktion vorhanden, so dass Korrekturen nicht f&uuml;r jeden einzelnen Sch&uuml;ler gemacht werden m&uuml;ssen.</p>
<p class="textcenter"><a class="other" href="Einlesen.html">Inhalt</a></p>
<hr width="90%">

<a name="Probleme"></a>
<p class="titleklein">Probleml&ouml;sungen</p>
<p class="text">Entsprechen die Dateien nicht dem geforderten Format k&ouml;nnen beim Einlesen Fehler auftreten. Die h&auml;ufigsten Fehler werden aber automatisch erkannt und k&ouml;nnen w&auml;hrend des Einlesens noch korrigiert werden.<br>
<br>
Ein Fehler tritt auf, wenn in der Sch&uuml;lerzeile die Sch&uuml;lernummer nicht dem Sch&uuml;lernamen entspricht. Entweder wurde beim Schreiben der Zeugnisse die Nummer ge&auml;ndert oder der Name anders geschrieben. Stellt Texel dies fest erschen ein Dialog in dem die Sch&uuml;lerzeile un der nachfolgende Text angezeigt wird. Sie k&ouml;nnen dann ausw&auml;hlen, zu welchem Sch&uuml;ler der Text geh&ouml;ren soll, oder angeben, dass der Text nicht aingelesen werden soll. Es kann auch vorkommen, dass Texel eine Textzeile f&uuml;r eine Sch&uuml;lerzeile h&auml;lt. Auch das kann in diesem Dialog angegeben werden.</p>
<p align="center"><img src="../Bilder/UnklareSchuelerzeile.gif" width="460" height="470" border="0" alt=""></p>

<p class="text">Es tritt vielleicht auch der Fall auf, das der Fachtext noch in der Sch&uuml;lerzeile beginnt, also kein Zeilenumbruch nach dem Sch&uuml;lernamen vorhanden ist. Ist eine Sch&uuml;lerzeile ungew&ouml;hnlich lang, merkt Texel dies und zeigt die Zeile in einem Dialog an. Sie k&ouml;nnen die Zeile jetzt noch an der richtigen Stelle durch Dr&uuml;cken der Eingabetaste trennen und das Einlesen fortsetzen.</p>
<p align="center"><img src="../Bilder/LangeSchuelerzeile.gif" width="495" height="372" border="0" alt=""></p>

<p class="text">Ist f&uuml;r ein Fach schon ein Text in der Datenbank abgespeichert, wird beim Einlesen gefragt, ob der alte Text ersetzt oder behalten werden soll. Der neue Text kann auch vor oder hinter den alten Text geh&auml;ngt werden. So k&ouml;nnen Texte von mehreren Kollegen zu einem Fach zusammengef&uuml;hrt werden.</p>
<p align="center"><img src="../Bilder/Textvorhanden.gif" width="393" height="188" border="0" alt=""></p>

<p class="text">Gibt es beim Einlesen andere Probleme und werden die Texte eines Faches nicht richtig eingelesen, muss die Datei korrigiert und erneut eingelesen werden.</p>
<p class="textcenter"><a class="other" href="Einlesen.html">Inhalt</a></p>

<a name="Verwaltung"></a>
<p class="titleklein">Verwalten der Fachtexte</p>
<p align="center"><img src="../Bilder/ButtonFachtexte.gif" width="126" height="30" border="0" alt=""><br>
<br>
<IMG SRC="../Bilder/Fachtexte.gif" WIDTH=259 HEIGHT=262 BORDER=0 ALT="" USEMAP="#Fachtexte_Map"></p>
<MAP NAME="Fachtexte_Map">
<AREA SHAPE="rect" ALT="" COORDS="8,197,183,234" title="Hier werden nur die Texte des ausgew&auml;hlten Fachs auf einem Extrakladdeblatt ausgedruckt.">
<AREA SHAPE="rect" ALT="" COORDS="7,163,181,197" title="Hier werden die Fachtexte des ausgew&auml;hlten Faches in einer Textdatei gespeichert.">
<AREA SHAPE="rect" ALT="" COORDS="8,131,178,161" title="Hier werden alle Texte des ausgew&auml;hlten Faches gel&ouml;scht.">
<AREA SHAPE="rect" ALT="" COORDS="11,67,237,131" title="W&auml;hlen Sie ein oder alle F&auml;cher aus.">
</MAP>
<p class="text">Hier k&ouml;nnen Sie s&auml;mtliche Texte eines Faches l&ouml;schen, auf ein Extrablatt ausdrucken oder als Textdatei abspeichern. So k&ouml;nnen z. B. Texte gel&ouml;scht werden, die fehlerhaft eingelesen wurden.</p>
<p class="textcenter"><a class="other" href="Einlesen.html">Inhalt</a></p>

</td></tr></table>
</body>
</html>