<html>
<head>
<title>&Uuml;berblick</title>
<meta name="author" content="Veit Gr&ouml;sch">
<link rel=stylesheet type="text/css" href="../Css/Zeugnisstyles.css">
</head>
<body alt="" border="0" text="#000000" bgcolor="#FFFFFF" link="#FF0000" alink="#FF0000" vlink="#FF0000">
<table width="100%" >
<tr>
 <td bgcolor="#EFEFEF" valign="top" width="200">
 <p class="title">Texel-Hilfe</p>
<img src="../Bilder/Logoklein.gif" width="200"  border="0" alt="">
<p class="textgcenter">
<a class="other" href="../../Texelhilfe.html">Einleitung</a><br>
<a class="other" href="Beispiele.html">Beispiele</a><br>
<a class="other" href="Ueberblick.html">&Uuml;berblick</a><br>
Installation<br>
<a class="other" href="Organisation.html">Organisation</a><br>
<a class="other" href="Einstellungen.html">Einstellungen</a><br>
<a class="other" href="Schuelerdaten.html">Sch&uuml;lerdaten</a><br>
<a class="other" href="Layout.html">Layout</a><br>
<a class="other" href="Dateivorlagen.html">Dateivorlagen</a><br>
<a class="other" href="Schreiben.html">Schreiben</a><br>
<a class="other" href="Einlesen.html">Einlesen</a><br>
<a class="other" href="Korrigieren.html">Korrigieren</a><br>
<a class="other" href="Ausdrucken.html">Ausdrucken</a><br>
<a class="other" href="Lueckentexteditor.html">L&uuml;ckentexteditor</a><br>
<a class="other" href="Kontakt.html">Kontakt</a><br>
<br></p>

 </td>
 <td valign="top">
<p class="title">Eine Zeugnisverwaltung f&uuml;r Waldorfschulen</p>

<p class="titleklein">Installation</p>

<p class="textcenter">
<a class="other" href="#Zeugnisdatenbanken">Die Zeugnisdatenbanken<br>
<a class="other" href="#Lueckentexteditor">Der L&uuml;ckentexteditor<br>
<a class="other" href="#Druckertreiber">A-3 Druckertreiber<br>
<a class="other" href="#Anleitungsblaetter">Anleitungsbl&auml;tter<br>
<a class="other" href="#Schriften">Schriften<br>
</p>


<hr width="90%">
<a name="Zeugnisdatenbanken"></a>
<p class="titleklein">Die Zeugnisdatenbanken</p>
<p class="text">Das Downloadpaket enth&auml;lt eine Datei mit der Zeugnisdatenbank Texel. Die Datenbank enth&auml;lt nur 2 Sch&uuml;ler mit allen Texten f&uuml;r diese Sch&uuml;ler. Hiermit k&ouml;nnen Sie alle <b>Funktionen ausprobieren</b> und sich mit dem Programm vertraut machen.<br>
Texel ist kein eigenst&auml;ndiges Programm. Es ist eine Anwendung f&uuml;r <b>Microsoft Access 2000 oder XP</b>. Access muss auf Ihrem Rechner installiert sein, dann ist eine Installation von Texel nicht n&ouml;tig. Sie k&ouml;nnen die Dateien in einen beliebigen Ordner kopieren und durch einen Doppelklick &ouml;ffnen.<br>
Wenn Sie eine Datenbank f&uuml;r einen neue Klasse anlegen m&ouml;chten, erstellen Sie eine Kopie einer beliebigen Texel-Datenbank.<br>
<br>
Wenn Sie die Daten aus einer Texeldatenbank in eine anderen Datenbank <b>&uuml;bernehmen</b> m&ouml;chten, z.B. wenn Sie auf eine <b>neue Texel-Version</b> umstellen, k&ouml;nnen Sie alle Daten und Texte &uuml;ber das <a class="other" href="Einstellungen.html#Importieren">Formular <i>Einstellungen</i></a> importieren.<br>
<br>

Bevor Sie Kopien f&uuml;r mehrere Klassen machen sollten Sie in einer Kopie alle <b>Anpassungen f&uuml;r Ihre Schule</b> vornehmen:<br>
Geben Sie im <a class="other" href="Einstellungen.html#Schulname">Formular <i>Einstellungen</i></a> den <b>Namen Ihrer Schule</b> ein. Der erscheint dann auf allen Zeugnisausdr&uuml;cken, au&szlig;er auf der Vorderseite des Doppelblattes.<br>
Das <b>Layout dieser Zeugnisvorderseite</b> m&uuml;ssen Sie von Hand anpassen. Dazu &ouml;ffnen Sie den Access-Bericht (report) <i>rptDoppelblattAu&szlig;enseite</i> &uuml;ber das Access-Datenbankfenster in der Entwurfsansicht.</p>
<p class="textcenter">Hier &ouml;ffnen sie den Bericht <i>rptDoppelblattAu&szlig;enseite</i>:<br><br>
<img src="../Bilder/Berichte.gif" width="379" height="264" border="0" alt=""></p>
<p class="text">Geben Sie in die Textfelder den Namen Ihrer Schule ein, in das leere vorhandene Bildfeld k&ouml;nnen Sie ein Logo Ihrer Schule einf&uuml;gen. Doppelklicken sie dazu auf das gro&szlig;e Bildfeld, um das Eigenschaftenfenster zu &ouml;ffnen und w&auml;hlen sie unter Format-Bild eine Bilddatei aus. Am besten betten Sie das Bild in die Datenbank ein.</p>
<p class="textcenter">Hier k&ouml;nnen sie ein Logo als Bild einf&uuml;gen:<br><br>
<img src="../Bilder/rptDoppelblattAussenseite.gif" width="522" height="565" border="0" alt=""></p>
<p class="text"> Ordnen Sie die Textfelder auf der Titelseite so an, bis es Ihren Vorstellungen entspricht. Speichern Sie anschlie&szlig;end den Bericht. Auch den Entwurf der Zeugnisr&uuml;ckseite k&ouml;nnen Sie im gleichen Bericht Ihren W&uuml;nschen anpassen. Sind Sie mit Access-Berichten nicht vertraut, kann ich Sie hier nur an die Access-Hilfe oder an die Fachliteratur verweisen. Es ist aber ganz einfach. Bedenken Sie, dass Sie eine <b>Vorschau des Berichts</b> als A3-Blatt nur sehen, wenn der Treiber f&uuml;r einen <b>A3-Drucker auf ihrem Rechner installiert</b> ist, und dieser Drucker f&uuml;r diesen Bericht ausgew&auml;hlt ist. Eine <a class="other" href="#Druckertreiber">Anleitung</a> dazu finden Sie auf dieser Seite.<br>
<br>
Bei der Anpassung des Layouts der F&auml;cher, k&ouml;nnen Sie die <b>Lehrernamen und die Fachnamen</b> &uuml;ber Auswahlfelder eingeben. Dazu m&uuml;ssen Sie diese Listen an Ihrer Schule anpassen. Auch bei der Eingabe der Sch&uuml;lerdaten, kann auch der <b>Geburtsort</b> aus einer Auswahlliste gew&auml;hlt werden. W&auml;hlen sie dazu die entsprechenden Tabellen auf dem <a class="other" href="Einstellungen.html#Listen">Formular <i>Einstellungen</i></a>.<br>
<br>
Speichern Sie die Texel-Datei nach allen Vorbereitungen als <b>Vorlage f&uuml;r alle Ihre Zeugnisdatenbanken</b>! Jetzt k&ouml;nnen Sie davon <b>Kopien f&uuml;r alle Klassen</b> erstellen und die vorhandenen Sch&uuml;lerdaten l&ouml;schen und neue eingeben.<br>
<br>
Beim <b>Schuljahreswechsel</b> kopieren Sie alle Texel-Dateien, archivieren die fertigen Zeugnisse und erh&ouml;hen in den Kopien die Klassennummer. Die alten Texte werden dann gel&ouml;scht, die Lehrernamen in das neue Schuljahr &uuml;bernommen und das neue Layout kann erstellt werden. Die mitgelieferten Beispiele enthalten noch die Layouts von Elmshorn f&uuml;r alle Klassen.<br>
<br>
Wenn Sie viel mit einer Datenbank gearbeitet haben, sollten Sie den Access-Menuepunkt <i>Extra - Datenbank Dienstprogramme - <b>Datenbank komprimieren und reparieren</b></i> aufrufen, damit die Datei nicht zu gro&szlig; wird.</p>
<p class="textcenter"><a class="other" href="Installation.html">Inhalt</a></p>
<hr width="90%">

<a name="Lueckentexteditor"></a>
<p class="titleklein">Der L&uuml;ckentexteditor</p>
<p class="text">Der L&uuml;ckentexteditor Lucky ist ein eigenst&auml;ndiges Programm, das unabh&auml;ngig von Access arbeitet. Es braucht auch nicht installiert zu werden. Sie brauchen nur die Datei <i>Lucky.exe</i> doppelzuklicken um das Programm zu starten. Eine <a class="other" href="Lueckentexteditor.html">Einf&uuml;hrung</a> finden Sie in dieser Hilfe.</p>
<p class="textcenter"><a class="other" href="Installation.html">Inhalt</a></p>
<hr width="90%">

<a name="Druckertreiber"></a>
<p class="titleklein">A-3 Druckertreiber</p>
<p class="text">Um eine <b>Vorschau der A3-Zeugnisbl&auml;tter</b> in Access zu erm&ouml;glichen, muss der <i>Treiber eines A3-Druckers</i> auf Ihrem Rechner installiert sein. Der Rechner braucht dazu aber nicht angeschlossen sein. Ein Treiber f&uuml;r einen A3-Drucker steht auf der Texel-Internetseite zum <a class="other" href="http://www.waldorf-elmshorn.de/Texel/Seiten/Download.html">Download</a> bereit. Laden Sie den Treiber herunter und installieren Sie den Drucker &uuml;ber die Systemsteuerung - Drucker und Faxger&auml;te - Drucker hinzuf&uuml;gen - Weiter - Lokaler Drucker - Weiter - Anschluss aussuchen - Weiter - Datentr&auml;ger - Durchsuchen. Suchen Sie jetzt den mitgelieferten Ordner mit den Treiberdateien bis die Datei hp2600p5.inf erscheint. W&auml;hlen Sie die Datei aus, best&auml;tigen Sie mit OK und beenden Sie die Installation.<br>
Um eine Vorschau der A3-Bl&auml;tter zu erhalten, muss der Drucker noch beim Einrichten der Seite ausgew&auml;hlt werden. Eine <a class="other" href="Ausdrucken.html#Vorbereitungen">Anleitung</a> hierzu finden Sie in dieser Hilfe.</p>
<p class="textcenter"><a class="other" href="Installation.html">Inhalt</a></p>
<hr width="90%">

<a name="Anleitungblaetter"></a>
<p class="titleklein">Anleitungbl&auml;tter</p>
<p class="text">Einige Informationsbl&auml;tter, die ich f&uuml;r die Kollegen unserer Schule geschrieben habe, sind ebenfalls als Word-Dateien beigef&uuml;gt. Vielleicht k&ouml;nnen Sie sie gebrauchen.</p>
<p class="textcenter"><a class="other" href="Installation.html">Inhalt</a></p>
<hr width="90%">

<a name="Schriften"></a>
<p class="titleklein">Schriften</p>
<p class="text">Das in Elmshorn benutzt Layout benutzt einige besondere Schriften. Diese sollten Sie vor der Benutzung der Beispiele &uuml;ber die Systemsteuerung installieren. <a class="other" href="Layout.html#Farbe">Weitere Informationen</a> &uuml;ber die Schriftarten in Texel finden Sie in dieser Hilfe.</p>
<p class="textcenter"><a class="other" href="Installation.html">Inhalt</a></p>
<hr width="90%">


</td></tr></table>
</body>
</html>