<html>
<head>
<title>&Uuml;berblick</title>
<meta name="author" content="Veit Gr&ouml;sch">
<link rel=stylesheet type="text/css" href="../Css/Zeugnisstyles.css">
</head>
<body alt="" border="0" text="#000000" bgcolor="#FFFFFF" link="#FF0000" alink="#FF0000" vlink="#FF0000">
<table width="100%" >
<tr>
 <td bgcolor="#EFEFEF" valign="top" width="200">
 <p class="title">Texel-Hilfe</p>
<img src="../Bilder/Logoklein.gif" width="200"  border="0" alt="">
<p class="textgcenter">
<a class="other" href="../../Texelhilfe.html">Einleitung</a><br>
<a class="other" href="Beispiele.html">Beispiele</a><br>
<a class="other" href="Ueberblick.html">&Uuml;berblick</a><br>
<a class="other" href="Installation.html">Installation</a><br>
<a class="other" href="Organisation.html">Organisation</a><br>
<a class="other" href="Einstellungen.html">Einstellungen</a><br>
<a class="other" href="Schuelerdaten.html">Sch&uuml;lerdaten</a><br>
Layout<br>
<a class="other" href="Dateivorlagen.html">Dateivorlagen</a><br>
<a class="other" href="Schreiben.html">Schreiben</a><br>
<a class="other" href="Einlesen.html">Einlesen</a><br>
<a class="other" href="Korrigieren.html">Korrigieren</a><br>
<a class="other" href="Ausdrucken.html">Ausdrucken</a><br>
<a class="other" href="Archivieren.html">Archivieren</a><br>
<a class="other" href="Kontakt.html">Kontakt</a><br>
<br></p>

 </td>
 <td valign="top">
<p class="title">Eine Zeugnisverwaltung f&uuml;r Waldorfschulen</p>
<p align="center"><img src="../Bilder/ButtonSeitenlayout.gif" width="150" height="29" border="0" alt=""></p>
<p class="textcenter">
Mit diesem Formular wird das Layout f&uuml;r die Zeugnisse festgelegt.
</p>

<p align="center"><IMG SRC="../Bilder/Layout.gif" WIDTH=633 HEIGHT=567 BORDER=0 ALT="" USEMAP="#Layout_Map"></p>
<MAP NAME="Layout_Map">
<AREA SHAPE="rect" ALT="" COORDS="12,519,164,561" HREF="#Anordnen" title="Alle Positionen der gerade angew&auml;hlten Seite werden gel&ouml;scht, um die F&auml;cher anschlie&szlig;end neu anordnen zu k&ouml;nnen.">
<AREA SHAPE="rect" ALT="" COORDS="165,522,314,559" HREF="#Anordnen" title="Alle Eintr&auml;ge werden nach Seite und Seitenposition geordnet angezeigt.">
<AREA SHAPE="rect" ALT="" COORDS="432,524,610,562" HREF="#Beenden" title="Schlie&szlig;en des Formulars und &Uuml;bernehmen aller &Auml;nderungen">
<AREA SHAPE="rect" ALT="" COORDS="434,489,607,526" HREF="#Beenden" title="Schlie&szlig;en des Formulars ohne die &Auml;nderungen zu &uuml;bernehmen.">
<AREA SHAPE="rect" ALT="" COORDS="312,527,430,562" HREF="#Beenden" title="Das Layout wird in den Zustand zur&uuml;ckgesetzt, in dem es sich beim &Ouml;ffnen des Dialogs befand.">
<AREA SHAPE="rect" ALT="" COORDS="312,492,434,527" HREF="#Beenden" title="Das Layout wird komplett gel&ouml;scht.">
<AREA SHAPE="rect" ALT="" COORDS="310,459,430,489" HREF="#Drucken" title="Das Layout wird ausgedruckt.">
<AREA SHAPE="rect" ALT="" COORDS="32,372,597,426" HREF="#Zusatzblatt" title="W&auml;hlen Sie hier aus, welche Zusatzbl&auml;tter auf jeden Fall gez&auml;hlt werden sollen.">
<AREA SHAPE="rect" ALT="" COORDS="557,107,609,369" HREF="#Anordnen" title="Die Position des Fachtext auf der Seite. Ein Doppelklick auf dieses Feld, weist dem Feld die n&auml;chste freie Position auf der Seite zu.">
<AREA SHAPE="rect" ALT="" COORDS="387,104,557,369" HREF="#Eintrag" title="W&auml;hlen Sie einen Lehrer f&uuml;r dieses Fach aus der Auswahlliste aus oder geben Sie einen neuen Namen ein.">
<AREA SHAPE="rect" ALT="" COORDS="182,104,387,364" HREF="#Eintrag" title="W&auml;hlen Sie ein Fach aus der Auswahlliste aus oder geben Sie einen neuen Fachnamen ein.">
<AREA SHAPE="rect" ALT="" COORDS="2,107,22,364" HREF="#Eintrag" title="Anfasser zum Ausw&auml;hlen eines Eintrags. Dr&uuml;cken Sie die Entfernen-Taste um einen Eintrag zu l&ouml;schen.">
<AREA SHAPE="rect" ALT="" COORDS="22,107,182,364" HREF="#Eintrag" title="W&auml;hlen Sie aus, auf welcher Seite der Fachtext erschenen soll.">
<AREA SHAPE="rect" ALT="" COORDS="350,64,482,104" HREF="#Farbe" title="W&auml;hlen Sie eine Schriftart f&uuml;r alle Texte aus.">
<AREA SHAPE="rect" ALT="" COORDS="232,66,347,104" HREF="#Farbe" title="Alle Zeugnisse werden wieder in der Standardfarbe blau gedruckt.">
<AREA SHAPE="rect" ALT="" COORDS="105,66,227,106" HREF="#Farbe" title="W&auml;hlen Sie eine neue Farbe f&uuml;r alle Zeugnisse aus.">
</MAP>


<p class="textcenter">
<a class="other" href="#Layout">Das Zeugnislayout<br>
<a class="other" href="#Farbe">Schriftart und Schriftfarbe<br>
<a class="other" href="#Eintrag">Einen Eintrag machen<br>
<a class="other" href="#Zusatzblatt">Zusatzbl&auml;tter<br>
<a class="other" href="#Anordnen">Die F&auml;cher anordnen<br>
<a class="other" href="#Drucken">Das Layout ausdrucken<br>
<a class="other" href="#Beenden">Beenden des Formulars<br>
</p>


<hr width="90%">
<a name="#Layout"></a>
<p class="titleklein">Das Zeugnislayout</p>
<p class="text">Das Layout dient zun&auml;chst dazu festzulegen, welcher Lehrer f&uuml;r welches Fach eine <b>Textvorlage auf seiner Diskette</b> bekommen soll. Beim Erzeugen der Dateivorlagen wird f&uuml;r jeden Layouteintrag eine Textdatei mit den Sch&uuml;lernamen erzeugt. Der Lehrername steht dabei oben in der Datei und kann dann noch ge&auml;ndert werden.<br>
Sp&auml;ter bem <b>Ausdrucken</b> der Zeugnisse bestimmt das Layout, welcher Text auf welche Seite gedruckt wird. Dabei wird nicht der Lehrername aus dem Layout benutzt, sondern der, der in der eingelesen Textdatei stand.<br>
Passen beim Ausdrucken nicht alle Texte auf eine Seite, k&ouml;nnen dann Fa&auml;cher auf eine andere oder neue Seite verschoben werden, bis das Layout zufrieden stellt.<br>
Der <b>Klassenlehrertext</b> muss f&uuml;r die erste bis achte Klasse als Fach Klassenlehrer mit in das Layout aufgenommen werden. Der <b>Zeugnisspruch</b> wird nicht als Layouteintrag aufgenommen. Der Klassenlehrer bekommt automatisch eine Dateivorlage f&uuml;r die Zeugnisspr&uuml;che. Wo der Zeugnisspruch gedruckt wird, auf das Innenblatt oder auf ein Extrablatt, kann im Druckformular festgelegt werden.<br>
In der Datenbank kann das Layout f&uuml;r alle Klassen gespeichert werden. Angezeigt wird nur das Layout der eingestellten Klasse. Um das Layout einer anderen Klassenstufe zu sehen, muss die Klassennummer ge&auml;ndert werden.</p>
<p class="textcenter"><a class="other" href="Layout.html">Inhalt</a></p>

<hr width="90%">
<a name="#Farbe"></a>
<p class="titleklein">Schriftart und Schriftfarbe</p>
<p class="text">Die <b>Standardfarbe</b> f&uuml;r die Zeugnisse ist das Blau mit dem Access-Code 15797277. Eine andere Farbe f&uuml;r alle Zeugnisseiten w&auml;hlen Sie mit der Schaltfl&auml;che <i>Farbe &auml;ndern</i> aus, die Standardfarbe k&ouml;nnen Sie mittels der Schaltfl&auml;che <i>Standardfarbe</i> ausw&auml;hlen.<br>
Die eingestellte <b>Schriftart</b> ist <i>TriathlonDB</i>, auf der Vorderseite wird au&szlig;erdem die Waldorfschrift benutzt. Beide Schriften werden im Downloadpaket mitgeliefert. Sie k&ouml;nnen die Schriftart f&uuml;r alle Zeugnisseiten mittels der Schaltfl&auml;che <i>Schriftart &auml;ndern</i> &auml;ndern. Die Waldorfschrift wird davon nicht ber&uuml;hrt. Diese muss f&uuml;r die <b>Titelseite des Zeugnisses</b> auf dem <i>Bericht rptDoppelblattAu&szlig;enseite</i> <a class="other" href="Installation.html#Zeugnisdatenbanken">von Hand ge&auml;ndert werden</a>, wenn das gew&uuml;nscht ist. Im gleichen Bericht muss auch der <b>Name der Schule</b> von Hand eingetragen werden. Auch ein <b>Logo</b>, das mitgedruckt werden soll, muss hier von Hand eingebunden werden.</p>
<p class="textcenter"><a class="other" href="Layout.html">Inhalt</a></p>

<hr width="90%">
<a name="#Eintrag"></a>
<p class="titleklein">Einen Eintrag machen</p>
<p class="text">Fachtexte k&ouml;nnen auf die Innenseite des Doppelblattes, auf die Vorder- oder R&uuml;ckseite des Einlegeblattes oder auf eines von f&uuml;nf m&ouml;glichen Zusatzbl&auml;ttern gedruckt werden.<br>
Zun&auml;chst legen sie f&uuml;r jedes Fach einen Eintrag an. Einen <b>neuen Eintrag</b> erzeugen Sie, indem Sie Eingaben in die leere Zeile ganz unten vornehmen. Zum <b>L&ouml;schen</b> eines Eintrags w&auml;hlen sie den eintrag mittels des Anfassers am linken Rand aus und dr&uuml;cken Sie die Entfernen-Taste.<br>
W&auml;hlen Sie dann die <b>Seite</b>, den <b>Fachnamen</b> und den <b>Lehrernamen</b> aus den Auswahllisten aus. Die Fachnamen und die Lehrernamen, die zur Auswahl angeboten werden, k&ouml;nnen Sie vom Formular <i>Einstellungen</i> aus <a class="other" href="Einstellungen.html#Listen">anpassen</a>. In der Tabelle mit den Lehrernamen ist auch ein <b>K&uuml;rzel</b> f&uuml;r jeden Lehrer festgelegt. Diese erschient in dem Dateinamen der Vorlagedateien dieses Lehrers, so dass diese leicht zugeordnet werden k&ouml;nnen.<br>
Ist die Klasse in einem Fach in <b>mehrere Gruppen</b> geteilt, die von verschiedenen Kollegen unterrichtet werden, machen Sie mehrere Eintr&auml;ge mit dem gleichen Fachnamen, aber verschiedenen Lehrernamen. Die Positionen k&ouml;nnen gleich oder einfach aufeinanderfolgend sein. Jeder Kollege bekommt dann eine Dateivorlgae f&uuml;r dieses Fach, tr&auml;gt aber nur Texte f&uuml;r seine Sch&uuml;ler ein. Sp&auml;ter werden dann alle Dateien eingelesen und jeder Sch&uuml;ler bekommt seinen Text.<br>
Entsprechend verfahren sie, wenn von <b>zwei Kollegen jeder einen Teil des Zeugnistextes</b> schreiben m&ouml;chte. Beim <a href="Einlesen.html#Probleme">Einlesen</a> der zweiten Datei k&ouml;nnen Sie dann angeben, dass die Texte aneinandergeh&auml;ngt werden sollen.</p>
<p class="textcenter"><a class="other" href="Layout.html">Inhalt</a></p>

<hr width="90%">
<a name="#zusatzblatt"></a>
<p class="titleklein">Zusatzbl&auml;tter</p>
<p class="text">Auf der <b>letzten Zeugnisseite</b> ist unten immer angegeben, wie viele Zusatzbl&auml;tter das Zeugnis enth&auml;lt. Angegeben wird dabei immer das Einlegeblatt, das ja zu jedem Zeugnis geh&ouml;rt. <b>Weitere Zusatzbl&auml;tter werden f&uuml;r jeden Sch&uuml;ler individuell gez&auml;hlt</b>, da nicht immer jeder Sch&uuml;ler ein Zusatzblatt bekommt. <b>Ein Eintrag im Layout reicht nicht aus, damit das Blatt gez&auml;hlt wird!</b><br>
Oft werden aber die Doppelseiten schon gedruckt, bevor die Texte f&uuml;r die Zusatzbl&auml;tter eingelesen wurden, oder das Zeugnis bekommt ein Zusatzblatt, das nicht mit Texel erstellt wird. Damit diese Bl&auml;tter dann in der Z&auml;hlung auftauchen, k&ouml;nnen Sie hier ein K&auml;stchen w&auml;hlen. Dieses Zusatzblatt wird dann immer mitgez&auml;hlt, auch wenn kein Text daf&uuml;r eingelesen wurde.</p>
<p class="textcenter"><a class="other" href="Layout.html">Inhalt</a></p>

<hr width="90%">
<a name="#Anordnen"></a>
<p class="titleklein">Die F&auml;cher anordnen</p>
<p class="text">Sind die F&auml;cher und Lehrer eingetragen, muss die <b>Position der F&auml;cher auf der Seite</b> angegeben werden. Bleibt die Postition 0, wird das Fach beim Erstellen der Dateivorlagen und beim Ausdrucken nicht ber&uuml;cksichtigt.<br>
Zum Anordnen doppelklicken sie am einfachsten jede Position in der Reihenfolge, in der sie auf der Seite erschienen sollen. Dann wird automatisch die n&auml;chste freie Position zugeordnet.<br>
Alle Positionen einer Seite <b>l&ouml;schen</b> sie mithilfe der Schaltfl&auml;che <i>Postionen l&ouml;schen</i>, die Schaltfl&auml;che <i>Anordnen</i> zeigt die F&auml;cher in der <b>richtigen Ordnung</b> an. Beide Schalter funktionieren nur richtig, wenn alle neu gemachten <b>Eintr&auml;ge gespeichert</b> wurden. Das geschieht durch Ausw&auml;hlen eines neuen Eintrags oder durch Dr&uuml;cken der Umstell- (Shift-) und Eingabe-Taste.</p>
<p class="textcenter"><a class="other" href="Layout.html">Inhalt</a></p>

<hr width="90%">
<a name="#Drucken"></a>
<p class="titleklein">Das Layout ausdrucken</p>
<p class="text">Damit jeder Klassenlehrer oder -betreuer pr&uuml;fen kann, ob alle F&auml;cher erfasst wurden, ob die F&auml;cher richtig benannt wurden und die richtigen Lehrer eingetragen wurden, kann das Layout ausgedruckt und zur Pr&uuml;fung verteilt werden. Das empfiehlt sich gleichzeitig mit dem Datenblatt mit den Sch&uuml;lerdaten zu machen. Auch Praktika und andere Projekte sollten nicht vergessen werden.</p>
<p class="textcenter"><a class="other" href="Layout.html">Inhalt</a></p>

<hr width="90%">
<a name="#Beenden"></a>
<p class="titleklein">Beenden des Formulars</p>
<p class="text">Die Schaltfl&auml;che <b>Layout l&ouml;schen</b> l&ouml;scht das gesamte Layout f&uuml;r diese Klasse.<br>
Die Schaltfl&auml;che <b>Zur&uuml;cksetzen</b> stellt den Zustand wieder her, wie er beim &Ouml;ffnen des Dialogs vorhanden war.<br>
Die Schaltfl&auml;che <b>&Auml;nderungen &uuml;bernehmen</b> speichert alle &Auml;nderungen und schlie&szlig;t das Formular.<br>
Die Schaltfl&auml;che <b>Abbrechen</b> speichert keine &Auml;nderungen und schlie&szlig;t das Formular.</p>
<p class="textcenter"><a class="other" href="Layout.html">Inhalt</a></p>


</td></tr></table>
</body>
</html>