<html>
<head>
<title>&Uuml;berblick</title>
<meta name="author" content="Veit Gr&ouml;sch">
<link rel=stylesheet type="text/css" href="../Css/Zeugnisstyles.css">
</head>
<body alt="" border="0" text="#000000" bgcolor="#FFFFFF" link="#FF0000" alink="#FF0000" vlink="#FF0000">
<table width="100%" >
<tr>
 <td bgcolor="#EFEFEF" valign="top" width="200">
 <p class="title">Texel-Hilfe</p>
<img src="../Bilder/Logoklein.gif" width="200"  border="0" alt="">
<p class="textgcenter">
<a class="other" href="../../Texelhilfe.html">Einleitung</a><br>
<a class="other" href="Beispiele.html">Beispiele</a><br>
<a class="other" href="Ueberblick.html">&Uuml;berblick</a><br>
<a class="other" href="Installation.html">Installation</a><br>
Organisation<br>
<a class="other" href="Einstellungen.html">Einstellungen</a><br>
<a class="other" href="Schuelerdaten.html">Sch&uuml;lerdaten</a><br>
<a class="other" href="Layout.html">Layout</a><br>
<a class="other" href="Dateivorlagen.html">Dateivorlagen</a><br>
<a class="other" href="Schreiben.html">Schreiben</a><br>
<a class="other" href="Einlesen.html">Einlesen</a><br>
<a class="other" href="Korrigieren.html">Korrigieren</a><br>
<a class="other" href="Ausdrucken.html">Ausdrucken</a><br>
<a class="other" href="Lueckentexteditor.html">L&uuml;ckentexteditor</a><br>
<a class="other" href="Kontakt.html">Kontakt</a><br>
<br></p>

 </td>
 <td valign="top">
<p class="title">Eine Zeugnisverwaltung f&uuml;r Waldorfschulen</p>
<p class="titleklein">Organisation</p>
<p class="textcenter">Sollen die Zeugnisse mehrerer Klassen gedruckt werden, ist eine gute Organisation der Abl&auml;ufe n&ouml;tig. Hier stelle ich den Ablauf vor, wie er sich in Elmhorn bew&auml;hrt hat. Jeder Schule sei dringend empfohlen, im ersten Jahr nur mit einer Klasse zu beginnen, damit sich alle Abl&auml;ufe einspielen k&ouml;nnen.
</p>

<p class="textcenter">
<a class="other" href="#Listen1">Listen f&uuml;r die Sch&uuml;lerdaten und das Layout<br>
<a class="other" href="#Disketten">Die Disketten<br>
<a class="other" href="#Listen2">Listen f&uuml;r die Fehlzeiten und die Religionstexte<br>
<a class="other" href="#letzteWoche">Die letzte Woche<br>
</p>


<hr width="90%">
<a name="Listen1"></a>
<p class="titleklein">Listen f&uuml;r die Sch&uuml;lerdaten und das Layout</p>
<p class="text">Im Februar geht es los in die n&auml;chste Zeugnisrunde. Ich <b>kopiere</b> die Dateien f&uuml;r die n&auml;chsten Klassen, erh&ouml;he in jeder Datei die <b>Klassennummer</b> und lese oder gebe die Sch&uuml;lerdaten in die Datei f&uuml;r einen neue Klasse ein.<br>
<br>
Dann drucke ich f&uuml;r jede Klasse die <b>Liste mit den Sch&uuml;lerdaten</b> aus. Diese muss von Klassenlehrer oder -betreuer kontrolliert und erg&auml;nzt werden. Diese erh&auml;lt er dann zusammen mit dem <b>Ausdruck des Layouts</b> f&uuml;r seine Klasse. Auch dies muss er pr&uuml;fen, die Fachlehrer fragen, wie das Fach hei&szlig;en soll und fehlende F&auml;cher hinzuf&uuml;gen.<br>
<br>
Es ist wichtig, dass diese Arbeit sorgf&auml;ltig geschieht, da darauf alle Dateien auf den Diskette beruhen. Sp&auml;tere &Auml;nderungen sind zwar m&ouml;glich und auch n&ouml;tig, wenn zum Beispiel noch ein Sch&uuml;ler hinzukommt, aber l&auml;stig.<br>
<br>
Ich gebe einen Termin vor, wann die Listen ausgef&uuml;llt zur&uuml;ck sein m&uuml;ssen.</p>
<p class="textcenter"><a class="other" href="Organisation.html">Inhalt</a></p>
<hr width="90%">

<a name="Disketten"></a>
<p class="titleklein">Die Disketten</p>
<p class="text">Sind alle Listen zur&uuml;ck, gebe ich alle <b>&Auml;nderungen in die Datenbanken ein</b> und erstelle alle <b>Dateivorlagen</b> f&uuml;r alle Klassen in einem gemeinsamen Verzeichnis auf der Festplatte. Dabei werden die Dateien automatisch nach den Lehrern sortiert in Verzeichnisse eingeordnet. F&uuml;r jeden Kollegen habe ich eine leere <b>Diskette</b> vorbereitet, auf die ich die jeweiligen Dateien kopiere. Diese stelle ich dann in eine Diskettenbox zusammen mit einem Hinweisblatt in das Lehrerzimmer, damit jeder seine Diskette nehmen kann. Die Disketten sind kein zuverl&auml;ssiges Speichermedium. Die Kollegen sollten ihre Dateien auf einer Festplatte speichern und regelm&auml;&szlig;ig <b>Sicherheitskopien</b> machen. Die Disketten dienen nur als Transportmedium. Die Diskette sollten vor den Fr&uuml;hjahrsferien bereit stehen, damit die Arbeit in den Ferien beginnen kann.</p>
<p class="textcenter"><a class="other" href="Organisation.html">Inhalt</a></p>
<hr width="90%">

<a name="Listen2"></a>
<p class="titleklein">Listen f&uuml;r die Fehlzeiten und die Religionstexte</p>
<p class="text">Etwa drei Woche vor Schuljahresende teile ich an die Klassenlehrer und -betreuer die Listen f&uuml;r die Fehlzeiten und die Religionstexte aus. Diese m&uuml;ssen etwa eine Woche vor Schuljahresende abgegeben sein. Die Daten geben ich dann in die Datenbank ein.</p>
<p class="textcenter"><a class="other" href="Organisation.html">Inhalt</a></p>
<hr width="90%">

<a name="letzteWoche"></a>
<p class="titleklein">Die letzte Woche</p>
<p class="text">Sollen die Zeugnisse an einem Freitag ausgeteilt werden sieht die letzte Woche in Elmshorn so aus:</p>
<table width = 100%>
<tr>
 <td valign="top" class="text" width="80" ><b>Montag:</b></td>
 <td class="text">Um 8 Uhr morgens m&uuml;ssen <b>alle Disketten abgegeben</b> sein. Dies ist der wichtigste Termin. Fehlen Disketten, kommt die ganze Unternehmung in Verzug.<br>
 Die Textdateien aller Disketten sammle ich dann in einem Verzeichnis auf der Festplatte. Mit anderen Kollegen schaue ich dann alle Dateien fl&uuml;chtig auf grobe Formfehler durch. Einige Word-Dokumente m&uuml;ssen dann noch als Textdatei gespeichert werden. Dann <b>lese ich die Dateien Klasse f&uuml;r Klasse ein</b>. Texel sucht sich automatisch die Dateien aus, die zur jeweiligen Klasse geh&ouml;ren und sortiert sie in ein Verzeichnis ein.<br>
 Gleich darauf drucke ich alle <b>Zeugnisse als Kladdekopie</b> aus.<br>
 Alle Sch&uuml;ler haben an diesem Tag nach der 4. Stunde frei, um 14 Uhr beginnt die <b>Zeugniskonferenz</b>, in der diese <b>Kladdeausdr&uuml;cke Korrektur gelesen</b> werden. Sind die ersten Seiten gelesen, beginnen einige Kollegen gleich damit, die <b>Korrekturen an meheren Rechnern in die Datenbank einzugeben</b>. Dazu ben&ouml;tigen wir f&uuml;r neun Klassen mindestens 6 bis 7 vernetzte Rechner. Alle Datenbanken liegen auf dem Server. Parallel dazu gehe ich mit den Klassenbetreuern das <b>Layout</b> durch und richte die Seiten so ein, dass alle Texte auf die Seiten passen. Die Konferenz ist erst beendet, wenn alle Korrekturen eingegeben sind.<br>
Dies ist f&uuml;r mich der stressigste Tag im Jahr!</td>
</tr>
<tr>
 <td valign="top" class="text"><b>Dienstag:</b></td>
 <td class="text">Jetzt werden die <b>Zeugnisse ausgedruckt</b>. Wir sind f&uuml;r 9 Klassen mit zwei A3-Druckern ausgekommen. Besser ist f&uuml;r so viele Klassen aber ein dritter Drucker. Entscheidend ist aber auch die Geschwindigkeit der Drucker. Wir sind zu zweit f&uuml;r die ganze letzte Woche vom Unterricht beurlaubt und k&ouml;nnen uns so um das Ausdrucken k&uuml;mmern. Es ist sinnvoll, fertige Klassenlehrerzeugnisse schon in der vorletzten Woche auszudrucken.</td>
</tr>
<tr>
 <td valign="top" class="text"><b>Mittwoch:</b></td>
 <td class="text">Bis Mittwoch um 16 Uhr m&uuml;ssen in Elmhorn alle Zeugnisse ausgedruckt sein, denn dann treffen wir uns zu einer <b>zweiten Zeugniskonferenz</b>. Jeder Klassenbetreuer legt seine Zeugnisse in seiner Klasse auf die Sch&uuml;lertische aus und alle Kollegen gehen durch die Klassen und <b>unterschreiben</b> ihre Texte. Dabei fallen immer noch viele Fehler auf, so dass ich im Rechnerraum damit besch&auml;ftigt bin, einzelne Zeugnisse neu zu drucken.</td>
</tr>
<tr>
 <td valign="top" class="text"><b>Donnerstag:</b></td>
 <td class="text">Obwohl die Zeugnisse auch <b>digital archiviert</b> werden, ist eine <b>Papierkopie</b> mit den Unterschriften n&ouml;tig. Die Zeugnisse werden jetzt also noch kopiert. Die 12. Klasse wird schon verabschiedet und erh&auml;lt ihre Zeugnisse.</td>
</tr>
<tr>
 <td valign="top" class="text"><b>Freitag:</b></td>
 <td class="text">Heute werden die Zeugnisse verteilt. Einige Fehler werden jetzt und auch noch im neuen Schuljahr bemerkt und m&uuml;ssen korrigiert werden. Die Datenbanken k&ouml;nnen jetzt auch im Sekretariat auf den Rechner kopiert werden, so dass auch dort leicht einzelne Zeugnisse als Kladdekopie ausgedruckt werden k&ouml;nnen.</td>
</tr>
</table>
<p class="textcenter"><a class="other" href="Organisation.html">Inhalt</a></p>



</td></tr></table>
</body>
</html>