<html>
<head>
<title>&Uuml;berblick</title>
<meta name="author" content="Veit Gr&ouml;sch">
<link rel=stylesheet type="text/css" href="../Css/Zeugnisstyles.css">
</head>
<body alt="" border="0" text="#000000" bgcolor="#FFFFFF" link="#FF0000" alink="#FF0000" vlink="#FF0000">
<table width="100%" >
<tr>
 <td bgcolor="#EFEFEF" valign="top" width="200">
 <p class="title">Texel-Hilfe</p>
<img src="../Bilder/Logoklein.gif" width="200"  border="0" alt="">
<p class="textgcenter">
<a class="other" href="../../Texelhilfe.html">Einleitung</a><br>
<a class="other" href="Beispiele.html">Beispiele</a><br>
<a class="other" href="Ueberblick.html">&Uuml;berblick</a><br>
<a class="other" href="Installation.html">Installation</a><br>
<a class="other" href="Organisation.html">Organisation</a><br>
<a class="other" href="Einstellungen.html">Einstellungen</a><br>
<a class="other" href="Schuelerdaten.html">Sch&uuml;lerdaten</a><br>
<a class="other" href="Layout.html">Layout</a><br>
<a class="other" href="Dateivorlagen.html">Dateivorlagen</a><br>
Schreiben<br>
<a class="other" href="Einlesen.html">Einlesen</a><br>
<a class="other" href="Korrigieren.html">Korrigieren</a><br>
<a class="other" href="Ausdrucken.html">Ausdrucken</a><br>
<a class="other" href="Archivieren.html">Archivieren</a><br>
<a class="other" href="Kontakt.html">Kontakt</a><br>
<br></p>

 </td>
 <td valign="top">
<p class="title">Eine Zeugnisverwaltung f&uuml;r Waldorfschulen</p>
<p class="textcenter">
Jeder Kollege bekommt eine Diskette mit Dateivorlagen f&uuml;r seine F&auml;cher und kann diese mit jedem Texteditor, auch mit Word, bearbeiten.
</p>





<p class="textcenter">
<a class="other" href="#Schreiben">Zeugnistexte schreiben<br>
<a class="other" href="#Vortexte">Vortexte<br>
<a class="other" href="#Lueckentexte">L&uuml;ckentexte<br>
<a class="other" href="#Absaetze">Abs&auml;tze und Leerzeilen<br>
</p>

<hr width="90%">
<a name="Schreiben"></a>
<p class="titleklein">Zeugnistexte schreiben</p>
<p align="center"><img src="../Bilder/Dateileer.gif" width="324" height="210" border="0" alt=""></p>
<p class="text">Im <b>Dateinamen</b> der Dateivorlagen finden Sie die Klasse, den Fachnamen in einfachen Anf&uuml;hrungzeichen und das K&uuml;rzel des Lehrers. Soll das Fach im Zeugnis unter einem anderen Namen erscheinen, kann der Dateiname entsprechend ge&auml;ndert werden. Die Texte werden dann beim Einlesen unter diesem neuen Fachnamen abgespeichert. Allerdings muss dann der Eintrag dieses Faches im Layout ge&auml;ndert werden, da sonst die Texte zu diesem Fach nicht gedruckt werden. Sie erhalten aber auch vor dem Drucken noch eine Warnung, dass f&uuml;r den neuen Fachnamen ein Layouteintrag fehlt.<br>
Die Dateivorlage enth&auml;lt in der ersten Zeile den <b>Lehrernamen</b>. Dieser kann auch ge&auml;ndert werden; dieser Lehrername wird beim Einlesen der Datei in die Datenbank als Lehrer f&uuml;r dieses Fach gespeichert, auch wenn er von dem Namen im Layout abweicht.<br>
Es folgt eine <b>Sch&uuml;lerzeile</b> f&uuml;r jeden Sch&uuml;ler: Diese enth&auml;lt zuerst die <b>Sch&uuml;lernummer</b>. Diese darf auf keinen Fall ver&auml;ndert werden, weil sonst die Zuordnung der Texte schwierig werden kann. Es folgt das Geschlecht des Sch&uuml;lers. Dies wird nur vom L&uuml;ckentexteditor Lucky ben&ouml;tigt, um die L&uuml;cken richtig zu f&uuml;llen. Der Lehrer soll im Zeugnistext den <b>Vornamen des Sch&uuml;lers</b> benutzen, der in der Sch&uuml;lerzeile aufgef&uuml;hrt wird, damit alle Zeugnisse einheitlich werden. Es ist der Vorname, der in der Datenbank eingegeben wurde, nicht der vollst&auml;ndige Vorname f&uuml;r das Titelblatt.
<p align="center"><img src="../Bilder/DateiTexte.gif" width="319" height="250" border="0" alt=""></p>
<p class="text">Nun kann der Lehrer unter jeder Sch&uuml;lerzeile in eine neue Zeile den <b>Text f&uuml;r den Sch&uuml;ler</b> schreiben. Beim Schreiben mit Word ist darauf zu achten, die Datei als Textdatei mit der Endung .txt und nicht als Worddokument mit der Endung .doc zu speichern. Sp&auml;ter k&ouml;nnen die Doc-Dateien aber auch noch umgewandelt werden.<br>
Den Texten k&ouml;nnen Kommentare hinzugef&uuml;gt werden, die nicht eingelsen werden. Dazu klammert man einen ganzen Absatz ein.<br>
Leerzeilen und Einz&uuml;ge am Zeilenanfang werden beim Einlesen gel&ouml;scht, um ein einheitliches Druckbild zu erhalten. Ausnahme bilden die <b>Zeugnisspr&uuml;che</b>. Hier sind Leerzeilen zur Gliederung der Strophen m&ouml;glich. Einz&uuml;ge werden ebenfalls gel&ouml;scht, da die Spr&uuml;che zentriert gedruckt werden. Die Zeile <b>F&uuml;r Peter</b> brauchen Sie auch nicht angegeben, sie wird automatisch mit ausgedruckt.</p>
<p class="textcenter"><a class="other" href="Schreiben.html">Inhalt</a></p>

<hr width="90%">
<a name="Vortexte"></a>
<p class="titleklein">Vortexte</p>
<p align="center"><img src="../Bilder/DateiVortext.gif" width="359" height="281" border="0" alt=""></p>
<p class="text">Zwischen der Lehrerzeile und der ersten Sch&uuml;lerzeile kann ein <b>Vortext</b> geschrieben werden, der jedem Sch&uuml;lertext vorangestellt wird. Der Sch&uuml;lertext wird ohne einen Zeilenumbruch an den Sch&uuml;lertext angef&uuml;gt, wenn der Vortext nicht den Befehl <b>(Absatz)</b> oder kurz (+) am Ende enth&auml;lt.<br>
Soll ein Sch&uuml;ler keinen Vortext erhalten, muss vor dem Sch&uuml;lertext der Befehl <b>(kein Vortext)</b> oder kurz (---) in einem eigenen Absatz stehen.<br>
Besitzt ein Sch&uuml;ler keinen individuellen Text, erh&auml;lt er auch keinen Vortext, es sei denn unter der Sch&uuml;lerzeile steht der Befehl <b>(nur Vortext)</b> in einem eigenem Absatz.</p>
<p class="textcenter"><a class="other" href="Schreiben.html">Inhalt</a></p>

<hr width="90%">
<a name="Lueckentexte"></a>
<p class="titleklein">L&uuml;ckentexte</p>
<p align="center"><img src="../Bilder/DateiLueckentexte.gif" width="421" height="307" border="0" alt=""></p>
<p class="text">Alle L&uuml;ckentextfunktionen lassen sich einfacher mit dem L&uuml;ckentexteditor <b>Lucky</b> benutzen. Diese Informationen beschreiben die M&ouml;glichkeiten L&uuml;ckentexte ohne Lucky zu verfassen:<br>
Der Vortext kann auch einfach als <b>Vorlage f&uuml;r einen L&uuml;ckentext</b> benutzt werden.<br>
Die Platzhalter <b>Vorname</b> oder <b>Vornames</b> werden beim Einlesen der Texte durch den Vornamen des Sch&uuml;lers bzw durch den Genitiv des Sch&uuml;lernamens ersetzt.<br>
<b>Geschlechtsabh&auml;ngige Ausdr&uuml;cke</b> werden als Beispiel so angegeben: (Er/Sie), (sein/ihr) usw.<br>
Andere <b>L&uuml;cken</b> werden benannt, indem dem Namen das Zeichen # vorangesetzt wird. Wie die L&uuml;cken f&uuml;r jeden Sch&uuml;ler gef&uuml;llt werden sollen, muss dann nach der Sch&uuml;lerzeile in einer eigenen Zeile angegeben werden. Im Beispiel sehen Sie wie.<br>
Im obigen Beispiel erhalten die Sch&uuml;ler also folgende Texte:<br><br>

Peter hat im Deutschunterricht seinen Aufsatz zum Thema "Faust und Gretchen" selbst&auml;ndig verfasst.<br>
Friederike hat im Deutschunterricht ihren Aufsatz zum Thema "Mephisto" selbst&auml;ndig und stilsicher verfasst.<br>
Karl hat im Deutschunterricht seinen Aufsatz zum Thema "Hexenk&uuml;che" gut verfasst. Er hat aufmerksam mitgearbeitet.<br><br>

Beachten Sie, dass Willi keinen Text bekommt, und dass bei Peter und Friederike der Befehl (nur Vortext) nicht n&ouml;tig ist, da ja L&uuml;ckentexte angegeben sind. Karl braucht diesen Befehl sowieso nicht, da noch ein individueller Text folgt.<br>
Die benannten L&uuml;cken k&ouml;nnen auch durch ganze S&auml;tze gef&uuml;llt werden. Ist bei dem Sch&uuml;ler keine Ersetzung angeben, bleibt die L&uuml;cke leer. So kann auch mit Satzbausteinen gearbeitet werden.
 </p>
<p class="textcenter"><a class="other" href="Schreiben.html">Inhalt</a></p>

<hr width="90%">
<a name="Absaetze"></a>
<p class="titleklein">Abs&auml;tze und Leerzeilen</p>
<p class="text">In Zeugnisspr&uuml;chen werden Abs&auml;tze und Leerzeilen &uuml;bernommen. In Klassenlehrertexten die Abs&auml;tze, in Fachzeugnissen werden alle Abs&auml;tze und Leerzeilen entfernt.<br>
 Sie k&ouml;nnen das beeinflussen indem Sie direkt unter die Lehrerzeile eine eigene Zeile: <b>(Abs&auml;tze)</b> bzw. <b>(Leerzeilen)</b> einf&uuml;gen. Dann werden auf jeden Fall Abs&auml;tze bzw. Leerzeilen und damit auch Abs&auml;tze &uuml;bernommen. Soll nur ein einzelner Absatzumbruch &uuml;bernommen werden schreiben Sie als letztes in den Absatz <b>(Absatz)</b>.
 </p>
<p class="textcenter"><a class="other" href="Schreiben.html">Inhalt</a></p>


</td></tr></table>
</body>
</html>